Catalogs/ФизическиеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ФизическиеЛица</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХранитьВБазе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартинкаХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаКартинки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ФизическиеЛица/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.ИмяФайлаКартинки = "" Тогда
		КартинкаВременноеХранилище = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"КартинкаХранилище");
	Иначе
		Попытка
			Обработчик = Новый ОписаниеОповещения("ЗагрузитьСДискаЗавершение", ЭтотОбъект);
			НачатьПомещениеФайла(Обработчик,,Объект.ИмяФайлаКартинки,Ложь,УникальныйИдентификатор);
		Исключение
			Сообщить("Не найден файл фото по адресу: " + Объект.ИмяФайлаКартинки);
		КонецПопытки;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.ХранитьВБазе Тогда
		Если ЭтоАдресВременногоХранилища(КартинкаВременноеХранилище) Тогда
			ДвоичныеДанные =  ПолучитьИзВременногоХранилища(КартинкаВременноеХранилище);
			ТекущийОбъект.ИмяФайлаКартинки = "";
			ТекущийОбъект.КартинкаХранилище = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));
		КонецЕсли; 
	Иначе
	    ТекущийОбъект.ИмяФайлаКартинки = ИмяФайла;
		ТекущийОбъект.КартинкаХранилище = Неопределено;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСДиска(Команда)
	КартинкаВременноеХранилище ="";
	Обработчик = Новый ОписаниеОповещения("ЗагрузитьСДискаЗавершение", ЭтотОбъект);
	НачатьПомещениеФайла(Обработчик,,,Истина,УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСДискаЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	Если Результат Тогда
		КартинкаВременноеХранилище = Адрес;
		ИмяФайла = ВыбранноеИмяФайла;
		Если Не ИмяФайла=Объект.ИмяФайлаКартинки Тогда
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
